In [1]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Practise").getOrCreate()

25/06/08 21:15:59 WARN Utils: Your hostname, Zohebs-MacBook-Pro.local resolves to a loopback address: 127.0.0.1; using 192.168.2.90 instead (on interface en0)
25/06/08 21:15:59 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/opt/homebrew/Caskroom/miniforge/base/envs/pyspark11/lib/python3.10/site-packages/pyspark/jars/spark-unsafe_2.12-3.2.1.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/06/08 21:16:00 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
spark

In [1]:
df = spark.read.csv("titanic.csv")

NameError: name 'spark' is not defined

In [4]:
df

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string, _c6: string, _c7: string, _c8: string, _c9: string, _c10: string]

In [5]:
df.show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                 _c0|   _c1|         _c2|  _c3|     _c4|          _c5|     _c6|    _c7|  _c8|  _c9|    _c10|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [6]:
df = spark.read.option('header', 'true').csv('titanic.csv')
df.show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
|    Ali, Mr. William|  male|          25|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [7]:
type(df)

pyspark.sql.dataframe.DataFrame

In [8]:
df.head()

Row(name='Abbing, Mr. Anthony', gender='male', age='42', class='3rd', embarked='S', country='United States', ticketno='5547', fare='7.11', sibsp='0', parch='0', survived='no')

In [9]:
df.printSchema()

root
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- age: string (nullable = true)
 |-- class: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- country: string (nullable = true)
 |-- ticketno: string (nullable = true)
 |-- fare: string (nullable = true)
 |-- sibsp: string (nullable = true)
 |-- parch: string (nullable = true)
 |-- survived: string (nullable = true)

In [10]:
df1 = spark.read.csv("titanic.csv", header=True, inferSchema=True)
df1.printSchema()

root
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- age: string (nullable = true)
 |-- class: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- country: string (nullable = true)
 |-- ticketno: string (nullable = true)
 |-- fare: string (nullable = true)
 |-- sibsp: string (nullable = true)
 |-- parch: string (nullable = true)
 |-- survived: string (nullable = true)

In [11]:
import pandas as pd

In [12]:
pandas_df = pd.read_csv("titanic.csv")
pandas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2207 entries, 0 to 2206
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      2207 non-null   object
 1   gender    2207 non-null   object
 2   age       2205 non-null   float64
 3   class     2207 non-null   object
 4   embarked  2207 non-null   object
 5   country   2126 non-null   object
 6   ticketno  1316 non-null   float64
 7   fare      1291 non-null   float64
 8   sibsp     1307 non-null   float64
 9   parch     1307 non-null   float64
 10  survived  2207 non-null   object
dtypes: float64(5), object(6)
memory usage: 189.8+ KB

Even though you're using inferSchema=True in your Spark read.csv() call, all columns are still being read as string. This happens because Spark’s schema inference is limited when reading CSV files, especially if:

The data has missing or inconsistent values.

The header row is misleading or malformed.

Spark reads only a small sample of data and can't confidently infer types.

In [13]:
df.select("name").show()

+--------------------+
|                name|
+--------------------+
| Abbing, Mr. Anthony|
|Abbott, Mr. Eugen...|
|Abbott, Mr. Rossm...|
|Abbott, Mrs. Rhod...|
|Abelseth, Miss. K...|
|Abelseth, Mr. Ola...|
| Abelson, Mr. Samuel|
|Abelson, Mrs. Hannah|
|Abī-Al-Munà, Mr. ...|
|Abrahamsson, Mr. ...|
|  Ådahl, Mr. Mauritz|
|     Adams, Mr. John|
|Ahlin, Mrs. Johan...|
|Aks, Master. Fran...|
|      Aks, Mrs. Leah|
|Aldworth, Mr. Aug...|
|Alexander, Mr. Wi...|
|Alhomäki, Mr. Ilm...|
|      Ali, Mr. Ahmed|
|    Ali, Mr. William|
+--------------------+
only showing top 20 rows

In [14]:
df.dtypes

[('name', 'string'),
 ('gender', 'string'),
 ('age', 'string'),
 ('class', 'string'),
 ('embarked', 'string'),
 ('country', 'string'),
 ('ticketno', 'string'),
 ('fare', 'string'),
 ('sibsp', 'string'),
 ('parch', 'string'),
 ('survived', 'string')]

In [15]:
## add columns in the data frame
df.withColumn("name + age", df['name']+df['age']).show(5)

+--------------------+------+---+-----+--------+-------------+--------+-----+-----+-----+--------+----------+
|                name|gender|age|class|embarked|      country|ticketno| fare|sibsp|parch|survived|name + age|
+--------------------+------+---+-----+--------+-------------+--------+-----+-----+-----+--------+----------+
| Abbing, Mr. Anthony|  male| 42|  3rd|       S|United States|    5547| 7.11|    0|    0|      no|      null|
|Abbott, Mr. Eugen...|  male| 13|  3rd|       S|United States|    2673|20.05|    0|    2|      no|      null|
|Abbott, Mr. Rossm...|  male| 16|  3rd|       S|United States|    2673|20.05|    1|    1|      no|      null|
|Abbott, Mrs. Rhod...|female| 39|  3rd|       S|      England|    2673|20.05|    1|    1|     yes|      null|
|Abelseth, Miss. K...|female| 16|  3rd|       S|       Norway|  348125| 7.13|    0|    0|     yes|      null|
+--------------------+------+---+-----+--------+-------------+--------+-----+-----+-----+--------+----------+
only showing top 5 rows

In [16]:
df.show(5)

+--------------------+------+---+-----+--------+-------------+--------+-----+-----+-----+--------+
|                name|gender|age|class|embarked|      country|ticketno| fare|sibsp|parch|survived|
+--------------------+------+---+-----+--------+-------------+--------+-----+-----+-----+--------+
| Abbing, Mr. Anthony|  male| 42|  3rd|       S|United States|    5547| 7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male| 13|  3rd|       S|United States|    2673|20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male| 16|  3rd|       S|United States|    2673|20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female| 39|  3rd|       S|      England|    2673|20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female| 16|  3rd|       S|       Norway|  348125| 7.13|    0|    0|     yes|
+--------------------+------+---+-----+--------+-------------+--------+-----+-----+-----+--------+
only showing top 5 rows

In [17]:
# rename column
df.withColumnRenamed("name", "Name").show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                Name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
| Abbing, Mr. Anthony|  male|          42|  3rd|       S|United States|    5547|   7.11|    0|    0|      no|
|Abbott, Mr. Eugen...|  male|          13|  3rd|       S|United States|    2673|  20.05|    0|    2|      no|
|Abbott, Mr. Rossm...|  male|          16|  3rd|       S|United States|    2673|  20.05|    1|    1|      no|
|Abbott, Mrs. Rhod...|female|          39|  3rd|       S|      England|    2673|  20.05|    1|    1|     yes|
|Abelseth, Miss. K...|female|          16|  3rd|       S|       Norway|  348125|   7.13|    0|    0|     yes|
|Abelseth, Mr. Ola...|  male|          25|  3rd|       S|United States|  348122|   7.13|    0|    0|     yes|
| Abelson, Mr. Samuel|  male|          30|  2nd|       C|       France|    3381|     24|    1|    0|      no|
|Abelson, Mrs. Hannah|female|          28|  2nd|       C|       France|    3381|     24|    1|    0|     yes|
|Abī-Al-Munà, Mr. ...|  male|          27|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|     yes|
|Abrahamsson, Mr. ...|  male|          20|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|     yes|
|  Ådahl, Mr. Mauritz|  male|          30|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|      no|
|     Adams, Mr. John|  male|          27|  3rd|       S|      England|  341826|   8.01|    0|    0|      no|
|Ahlin, Mrs. Johan...|female|          40|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|      no|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|      Aks, Mrs. Leah|female|          18|  3rd|       S|      England|  392091|   9.07|    0|    1|     yes|
|Aldworth, Mr. Aug...|  male|          35|  2nd|       S|      England|  248744|     13|    0|    0|      no|
|Alexander, Mr. Wi...|  male|          25|  3rd|       S|      England|    3474| 7.1709|    0|    0|      no|
|Alhomäki, Mr. Ilm...|  male|          19|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|      no|
|      Ali, Mr. Ahmed|  male|          24|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|      no|
|    Ali, Mr. William|  male|          25|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|      no|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [18]:
# change data type of columns
from pyspark.sql.types import StructType, StructField, StringType, IntegerType, DoubleType

schema = StructType([
    StructField("name", StringType(), True),
    StructField("gender", StringType(), True),
    StructField("age", DoubleType(), True),
    StructField("class", StringType(), True),
    StructField("embarked", StringType(), True),
    StructField("country", StringType(), True),
    StructField("ticketno", StringType(), True),
    StructField("fare", DoubleType(), True),
    StructField("sibsp", IntegerType(), True),
    StructField("parch", IntegerType(), True),
    StructField("survived", IntegerType(), True)
])
df = spark.read.csv("titanic.csv", header=True, schema=schema)
df.printSchema()

root
 |-- name: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- age: double (nullable = true)
 |-- class: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- country: string (nullable = true)
 |-- ticketno: string (nullable = true)
 |-- fare: double (nullable = true)
 |-- sibsp: integer (nullable = true)
 |-- parch: integer (nullable = true)
 |-- survived: integer (nullable = true)

In [19]:
# add column
df = df.withColumn("test", df['age'])

In [20]:
df.head()

Row(name='Abbing, Mr. Anthony', gender='male', age=42.0, class='3rd', embarked='S', country='United States', ticketno='5547', fare=7.11, sibsp=0, parch=0, survived=None, test=42.0)

In [21]:
df = df.drop("test")

## Handling missing values

In [22]:
df.na.drop().show()

+----+------+---+-----+--------+-------+--------+----+-----+-----+--------+
|name|gender|age|class|embarked|country|ticketno|fare|sibsp|parch|survived|
+----+------+---+-----+--------+-------+--------+----+-----+-----+--------+
+----+------+---+-----+--------+-------+--------+----+-----+-----+--------+

In [23]:
# drop na has 3 optional parameters
# how : str, optional
#     'any' or 'all'.
#     If 'any', drop a row if it contains any nulls.
#     If 'all', drop a row only if all its values are null.
# thresh: int, optional
#     default None
#     If specified, drop rows that have less than `thresh` non-null values.
#     This overwrites the `how` parameter.
# subset : str, tuple or list, optional
#     optional list of column names to consider.
df.na.drop(how="any", thresh=3).show()

+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno|   fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
| Abbing, Mr. Anthony|  male|        42.0|  3rd|       S|United States|    5547|   7.11|    0|    0|    null|
|Abbott, Mr. Eugen...|  male|        13.0|  3rd|       S|United States|    2673|  20.05|    0|    2|    null|
|Abbott, Mr. Rossm...|  male|        16.0|  3rd|       S|United States|    2673|  20.05|    1|    1|    null|
|Abbott, Mrs. Rhod...|female|        39.0|  3rd|       S|      England|    2673|  20.05|    1|    1|    null|
|Abelseth, Miss. K...|female|        16.0|  3rd|       S|       Norway|  348125|   7.13|    0|    0|    null|
|Abelseth, Mr. Ola...|  male|        25.0|  3rd|       S|United States|  348122|   7.13|    0|    0|    null|
| Abelson, Mr. Samuel|  male|        30.0|  2nd|       C|       France|    3381|   24.0|    1|    0|    null|
|Abelson, Mrs. Hannah|female|        28.0|  2nd|       C|       France|    3381|   24.0|    1|    0|    null|
|Abī-Al-Munà, Mr. ...|  male|        27.0|  3rd|       C|      Lebanon|    2699|18.1509|    0|    0|    null|
|Abrahamsson, Mr. ...|  male|        20.0|  3rd|       S|      Finland| 3101284| 7.1806|    0|    0|    null|
|  Ådahl, Mr. Mauritz|  male|        30.0|  3rd|       S|       Sweden|    7076|   7.05|    0|    0|    null|
|     Adams, Mr. John|  male|        27.0|  3rd|       S|      England|  341826|   8.01|    0|    0|    null|
|Ahlin, Mrs. Johan...|female|        40.0|  3rd|       S|       Sweden|    7546| 9.0906|    1|    0|    null|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091|   9.07|    0|    1|    null|
|      Aks, Mrs. Leah|female|        18.0|  3rd|       S|      England|  392091|   9.07|    0|    1|    null|
|Aldworth, Mr. Aug...|  male|        35.0|  2nd|       S|      England|  248744|   13.0|    0|    0|    null|
|Alexander, Mr. Wi...|  male|        25.0|  3rd|       S|      England|    3474| 7.1709|    0|    0|    null|
|Alhomäki, Mr. Ilm...|  male|        19.0|  3rd|       S|      Finland| 3101287| 7.1806|    0|    0|    null|
|      Ali, Mr. Ahmed|  male|        24.0|  3rd|       S|    Argentina| 3101311|   7.01|    0|    0|    null|
|    Ali, Mr. William|  male|        25.0|  3rd|       S|    Argentina| 3101312|   7.01|    0|    0|    null|
+--------------------+------+------------+-----+--------+-------------+--------+-------+-----+-----+--------+
only showing top 20 rows

In [24]:
from pyspark.sql.types import StructType, StructField, StringType, IntegerType
from pyspark.sql import Row

# Initialize SparkSession
spark = SparkSession.builder.appName("SampleTable").getOrCreate()

# Sample data with some null values
data = [
    (1, "Alice", 23, None, "New York"),
    (2, "Bob", None, "M", "Los Angeles"),
    (3, None, 35, "F", "Chicago"),
    (4, "David", 40, "M", None)
]

# Define schema
columns = ["id", "name", "age", "gender", "city"]

# Create DataFrame
df_w_null = spark.createDataFrame(data, columns)

# Show DataFrame
df_w_null.show()

+---+-----+----+------+-----------+
| id| name| age|gender|       city|
+---+-----+----+------+-----------+
|  1|Alice|  23|  null|   New York|
|  2|  Bob|null|     M|Los Angeles|
|  3| null|  35|     F|    Chicago|
|  4|David|  40|     M|       null|
+---+-----+----+------+-----------+

In [25]:
df_w_null

DataFrame[id: bigint, name: string, age: bigint, gender: string, city: string]

In [26]:
# fill missing values
df_w_null.na.fill('Missing values').show()

+---+--------------+----+--------------+--------------+
| id|          name| age|        gender|          city|
+---+--------------+----+--------------+--------------+
|  1|         Alice|  23|Missing values|      New York|
|  2|           Bob|null|             M|   Los Angeles|
|  3|Missing values|  35|             F|       Chicago|
|  4|         David|  40|             M|Missing values|
+---+--------------+----+--------------+--------------+

In [28]:
# replace null value with 'missing values' string in only city column
df_w_null.na.fill('Missing values', 'city').show()

+---+-----+----+------+--------------+
| id| name| age|gender|          city|
+---+-----+----+------+--------------+
|  1|Alice|  23|  null|      New York|
|  2|  Bob|null|     M|   Los Angeles|
|  3| null|  35|     F|       Chicago|
|  4|David|  40|     M|Missing values|
+---+-----+----+------+--------------+

In [37]:
# replace with mean of the the gicen column
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age'],
    outputCols=[f"{c} imputed" for c in ['age']]
    ).setStrategy('mean')

In [38]:
imputer.fit(df_w_null).transform(df_w_null).show()

+---+-----+----+------+-----------+-----------+
| id| name| age|gender|       city|age imputed|
+---+-----+----+------+-----------+-----------+
|  1|Alice|  23|  null|   New York|         23|
|  2|  Bob|null|     M|Los Angeles|         32|
|  3| null|  35|     F|    Chicago|         35|
|  4|David|  40|     M|       null|         40|
+---+-----+----+------+-----------+-----------+

## Filter operations

In [43]:
# get people less than age of 40
df.filter("age<40").select(['name', 'age']).show()

+--------------------+------------+
|                name|         age|
+--------------------+------------+
|Abbott, Mr. Eugen...|        13.0|
|Abbott, Mr. Rossm...|        16.0|
|Abbott, Mrs. Rhod...|        39.0|
|Abelseth, Miss. K...|        16.0|
|Abelseth, Mr. Ola...|        25.0|
| Abelson, Mr. Samuel|        30.0|
|Abelson, Mrs. Hannah|        28.0|
|Abī-Al-Munà, Mr. ...|        27.0|
|Abrahamsson, Mr. ...|        20.0|
|  Ådahl, Mr. Mauritz|        30.0|
|     Adams, Mr. John|        27.0|
|Aks, Master. Fran...|0.8333333333|
|      Aks, Mrs. Leah|        18.0|
|Aldworth, Mr. Aug...|        35.0|
|Alexander, Mr. Wi...|        25.0|
|Alhomäki, Mr. Ilm...|        19.0|
|      Ali, Mr. Ahmed|        24.0|
|    Ali, Mr. William|        25.0|
|Allen, Miss. Elis...|        29.0|
|Allen, Mr. Willia...|        39.0|
+--------------------+------------+
only showing top 20 rows

In [44]:
df.filter(df['age']<20).show(5)

+--------------------+------+------------+-----+--------+-------------+--------+-----+-----+-----+--------+
|                name|gender|         age|class|embarked|      country|ticketno| fare|sibsp|parch|survived|
+--------------------+------+------------+-----+--------+-------------+--------+-----+-----+-----+--------+
|Abbott, Mr. Eugen...|  male|        13.0|  3rd|       S|United States|    2673|20.05|    0|    2|    null|
|Abbott, Mr. Rossm...|  male|        16.0|  3rd|       S|United States|    2673|20.05|    1|    1|    null|
|Abelseth, Miss. K...|female|        16.0|  3rd|       S|       Norway|  348125| 7.13|    0|    0|    null|
|Aks, Master. Fran...|  male|0.8333333333|  3rd|       S|      England|  392091| 9.07|    0|    1|    null|
|      Aks, Mrs. Leah|female|        18.0|  3rd|       S|      England|  392091| 9.07|    0|    1|    null|
+--------------------+------+------------+-----+--------+-------------+--------+-----+-----+-----+--------+
only showing top 5 rows

In [46]:
df.filter((df['age']<20) & (df['age'] >15)).show(5)

+--------------------+------+----+-----+--------+-------------+--------+------+-----+-----+--------+
|                name|gender| age|class|embarked|      country|ticketno|  fare|sibsp|parch|survived|
+--------------------+------+----+-----+--------+-------------+--------+------+-----+-----+--------+
|Abbott, Mr. Rossm...|  male|16.0|  3rd|       S|United States|    2673| 20.05|    1|    1|    null|
|Abelseth, Miss. K...|female|16.0|  3rd|       S|       Norway|  348125|  7.13|    0|    0|    null|
|      Aks, Mrs. Leah|female|18.0|  3rd|       S|      England|  392091|  9.07|    0|    1|    null|
|Alhomäki, Mr. Ilm...|  male|19.0|  3rd|       S|      Finland| 3101287|7.1806|    0|    0|    null|
|Allum, Mr. Owen G...|  male|18.0|  3rd|       S|      England|    2223|  8.06|    0|    0|    null|
+--------------------+------+----+-----+--------+-------------+--------+------+-----+-----+--------+
only showing top 5 rows

In [48]:
df.filter((df['age']==18) | (df['age']==19)).show(5)

+--------------------+------+----+-----+--------+-------+--------+------+-----+-----+--------+
|                name|gender| age|class|embarked|country|ticketno|  fare|sibsp|parch|survived|
+--------------------+------+----+-----+--------+-------+--------+------+-----+-----+--------+
|      Aks, Mrs. Leah|female|18.0|  3rd|       S|England|  392091|  9.07|    0|    1|    null|
|Alhomäki, Mr. Ilm...|  male|19.0|  3rd|       S|Finland| 3101287|7.1806|    0|    0|    null|
|Allum, Mr. Owen G...|  male|18.0|  3rd|       S|England|    2223|  8.06|    0|    0|    null|
|Al-Munà, Mr. Farī...|  male|19.0|  3rd|       C|Lebanon|    2700|7.0407|    0|    0|    null|
|Andersen-Jensen, ...|female|19.0|  3rd|       S|Denmark|  350046|7.1701|    1|    0|    null|
+--------------------+------+----+-----+--------+-------+--------+------+-----+-----+--------+
only showing top 5 rows

In [49]:
# inverse function
df.filter(~(df['age']<20)).show(5)

+--------------------+------+----+-----+--------+-------------+--------+-----+-----+-----+--------+
|                name|gender| age|class|embarked|      country|ticketno| fare|sibsp|parch|survived|
+--------------------+------+----+-----+--------+-------------+--------+-----+-----+-----+--------+
| Abbing, Mr. Anthony|  male|42.0|  3rd|       S|United States|    5547| 7.11|    0|    0|    null|
|Abbott, Mrs. Rhod...|female|39.0|  3rd|       S|      England|    2673|20.05|    1|    1|    null|
|Abelseth, Mr. Ola...|  male|25.0|  3rd|       S|United States|  348122| 7.13|    0|    0|    null|
| Abelson, Mr. Samuel|  male|30.0|  2nd|       C|       France|    3381| 24.0|    1|    0|    null|
|Abelson, Mrs. Hannah|female|28.0|  2nd|       C|       France|    3381| 24.0|    1|    0|    null|
+--------------------+------+----+-----+--------+-------------+--------+-----+-----+-----+--------+
only showing top 5 rows

## GroupBy and Aggregate

In [50]:
# groupby
df.groupBy('name')

In [54]:
df.groupBy('name').sum().show()

+--------------------+--------+---------+----------+----------+-------------+
|                name|sum(age)|sum(fare)|sum(sibsp)|sum(parch)|sum(survived)|
+--------------------+--------+---------+----------+----------+-------------+
|Chibnall, Mrs. Ed...|    48.0|     55.0|         0|         1|         null|
| Leroy, Miss. Berthe|    27.0| 106.0806|         0|         0|         null|
|Lockyer, Mr. Edwa...|    19.0|   7.1707|         0|         0|         null|
|Parr, Mr. William...|    30.0|     null|         0|         0|         null|
|Rosblom, Miss. Sa...|     2.0|  20.0403|         1|         1|         null|
|Young, Miss. Mari...|    36.0| 135.1208|         0|         0|         null|
|   Blaney, Mr. James|    32.0|     null|      null|      null|         null|
|Broom, Mr. Herber...|    33.0|     null|      null|      null|         null|
|Noss, Mr. Bertram...|    21.0|     null|      null|      null|         null|
|Abrahamsson, Mr. ...|    20.0|   7.1806|         0|         0|         null|
|    Dimic, Mr. Jovan|    42.0|   8.1303|         0|         0|         null|
|Harper, Mr. Henry...|    48.0|  76.1407|         1|         0|         null|
|Jabbur (Zabour), ...|    19.0|  14.0901|         1|         0|         null|
|Madigan, Miss. Ma...|    21.0|     7.15|         0|         0|         null|
|Stengel, Mrs. Ann...|    43.0|   55.081|         1|         0|         null|
|Woodward, Mr. Joh...|    32.0|     null|      null|      null|         null|
|Bristow, Mr. Robe...|    31.0|     null|      null|      null|         null|
|   Casey, Mr. Thomas|    44.0|     null|      null|      null|         null|
|Hodgkinson, Mr. L...|    46.0|     null|      null|      null|         null|
|Mabey, Mr. John C...|    24.0|     null|      null|      null|         null|
+--------------------+--------+---------+----------+----------+-------------+
only showing top 20 rows

In [62]:
# group by class and get avg age
df.groupBy('class').mean().select(['class', 'avg(age)']).show()

+----------------+------------------+
|           class|          avg(age)|
+----------------+------------------+
|             2nd|29.919014084506696|
|       deck crew| 34.18181818181818|
|             1st|39.163323045267596|
|engineering crew| 31.25925925925926|
|victualling crew|32.559164733178655|
|restaurant staff|25.420289855072465|
|             3rd| 25.13873173031584|
+----------------+------------------+

In [69]:
df.agg({'age':'mean'}).show()

+------------------+
|          avg(age)|
+------------------+
|30.444444444444397|
+------------------+

In [72]:
# oldes person in each class
df.groupBy('class').max().select(['class', 'max(age)']).show()

+----------------+--------+
|           class|max(age)|
+----------------+--------+
|             2nd|    72.0|
|       deck crew|    63.0|
|             1st|    71.0|
|engineering crew|    61.0|
|victualling crew|    59.0|
|restaurant staff|    49.0|
|             3rd|    74.0|
+----------------+--------+